public class Main {
    public static void main(String[] args)
    {
        int i= 20;
        byte w= 127;
        short a = 23;
        long b= 5246;
        float j= 12.5F;
        double d = 544;
        System.out.println(i+"  "+w+"  "+a+"  "+b+"   "+j+"    "+d);

  //--------------------------------------------------

        float f =12.75F;
        long s = 987678965549L;
        boolean q = false;
        float ht = 2.786F;
        int lk = 569;
        short ld= -159;
        short dd= 27897;
        byte kk = 67;

//----------------------------------------------------------

   /*
   Трое школьных учителей, Людмила Павловна, Анна Сергеевна и Екатерина Андреевна, ведут три класса.
У Людмилы Павловны 23 ученика , у Анны Сергеевны 27 учеников и у Екатерины Андреевны – 30 учеников.
Три учительницы закупили все вместе 480 листов бумаги на все три класса. Посчитайте, сколько достанется листов каждому ученику.
Результат задачи выведите в консоль в формате “На каждого ученика рассчитано … листов бумаги”.
Для объявления переменных не используйте тип var.
   */


    }
}